{
    "array": [
        {
            "title": "Helpdesk Technician",
            "employer": "College of the Ozarks IT Department",
            "beginMonth": "January",
            "beginYear": "2017",
            "endMonth": "December",
            "endYear": "2017",
            "description": "I am currently employed at the College of the Ozarks Computer Center, the IT helpdesk for the college. Typical jobs include: troubleshooting PC’s, printers, and other associated devices; diagnosing issues over the phone; explaining technical concepts to faculty and staff; discussing issues via live chat and phone calls with manufacturers; and updating and troubleshooting a plethora of software from various vendors."
        },
        {
            "title": "Web Developer",
            "employer": "College of the Ozarks IT Department",
            "beginMonth": "January",
            "beginYear": "2018",
            "endMonth": "",
            "endYear": "",
            "description": "For six weeks during the summer of 2017, I worked as a developer on the College of the Ozarks Computer Center's internal helpdesk website. This job involved working with API’s from various vendors, designing new web pages in the Web Forms paradigm with ASP.NET, retrieving and formatting data with Microsoft SQL Server Management Studio, and using SourceTree for source control."
        },
        {
            "title": "Studen Manager",
            "employer": "Bobcat Food Services",
            "beginMonth": "August",
            "beginYear": "2016",
            "endMonth": "December",
            "endYear": "2016",
            "present": false,
            "description": "For a single semester, I worked as a student manager at Bobcat Food Services, the department of the College of the Ozarks responsible for feeding the students, faculty, and staff. As a student manager, I was expected to manage between six and twenty student workers, occasionally assisted by another student manager. Two full-time managers and small full-time kitchen staff provided supervision. I acted as an intermediary between upper management and the student workers, assured timely and safe preparation of food, and directed the student workers in maintaining a clean and professional dining environment. Occasionally, I was expected to assist or direct catered meals, including an annual alumni dinner. Expectations included conflict management, employee relations, and professional interaction with students, faculty, staff, and members of the public."
        }
    ]
}